#+TITLE:Program assignment No. 10 - Fibonacci Series
#+Autthor: WYATT FRERICHS PLEDGED <*(~_~)
#+PROPERTY: :main yes :includes <stdio.h> :tangle fibonacci.c :results output
* Bonus challenge 1 - check result

1) Compare your result them with the correct Fibonacci sequence, which
   is stored [[https://raw.githubusercontent.com/birkenkrahe/cc101/piHome/7_arrays/src/fibonacci][in GitHub as fibonacci]] - download: [[https://tinyurl.com/4djnkr6h][tinyurl.com/4djnkr6h]].

2) You have to read the file into your computer using ~scanf~ and then
   compare two arrays element by element.

3) Tip: use an ~IF...ELSE~ or ~SWITCH...CASE~~ selection statement to
   perform the check.
#+BEGIN_SRC C :cmdline < fibb :noweb yes
      <<sauce>>
    <<printarr>>
      int ans[30];
      for(i=0; i < 30; i++){
	scanf("%d,", &ans[i]);
      }
     for(i=0; i<30;i++){
     if(fib[i] != ans[i]){
       printf("wrong %d",i);
       break;
     }
     else(){puts("youre a genius");}
    }

    printarr(ans,30);
#+END_SRC

#+RESULTS:
| youre                  | a | genius |
| youre                  | a | genius |
| youre                  | a | genius |
| youre                  | a | genius |
| youre                  | a | genius |
| youre                  | a | genius |
| youre                  | a | genius |
| youre                  | a | genius |
| youre                  | a | genius |
| youre                  | a | genius |
| youre                  | a | genius |
| youre                  | a | genius |
| youre                  | a | genius |
| youre                  | a | genius |
| youre                  | a | genius |
| youre                  | a | genius |
| youre                  | a | genius |
| youre                  | a | genius |
| youre                  | a | genius |
| youre                  | a | genius |
| youre                  | a | genius |
| youre                  | a | genius |
| youre                  | a | genius |
| youre                  | a | genius |
| youre                  | a | genius |
| youre                  | a | genius |
| youre                  | a | genius |
| youre                  | a | genius |
| youre                  | a | genius |
| youre                  | a | genius |
| 112358                 |   |        |
| 1321345589144.0        |   |        |
| 2.333776109871597e+19  |   |        |
| 4.181676510946177e+27  |   |        |
| 7.5025121393196415e+28 |   |        |

* Bonus challenge 2 - vary printing format

Print the first 30 Fibonacci numbers as a 6 x 5 matrix.

#+begin_example
   fib[ 0] = 0   ... fib[23] = 28657
   fib[ 1] = 1   ... fib[24] = 46368
   fib[ 2] = 1   ... fib[25] = 75025
   fib[ 3] = 2   ... fib[26] = 121393
   fib[ 4] = 3   ... fib[27] = 196418 
   fib[ 5] = 5   ... fib[28] = 317811
   fib[ 6] = 8   ... fib[29] = 514229
#+end_example
#+BEGIN_SRC C :noweb yes
<<printarr>>
 <<sauce>>
printarr(fib,30);
#+END_SRC

#+RESULTS:
| Fib[0]==0      | Fib[1]==1       | Fib[2]==1       | Fib[3]==2       | Fib[4]==3       | Fib[5]==5      | Fib[6]==8 |
| Fib[7]==13     | Fib[8]==21      | Fib[9]==34      | Fib[10]==55     | Fib[11]==89     | Fib[12]==144   |           |
| Fib[13]==233   | Fib[14]==377    | Fib[15]==610    | Fib[16]==987    | Fib[17]==1597   | Fib[18]==2584  |           |
| Fib[19]==4181  | Fib[20]==6765   | Fib[21]==10946  | Fib[22]==17711  | Fib[23]==28657  | Fib[24]==46368 |           |
| Fib[25]==75025 | Fib[26]==121393 | Fib[27]==196418 | Fib[28]==317811 | Fib[29]==514229 |                |           |

